#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.linode_lke_kubevela.helm_release.kubevela will be created
  + resource "helm_release" "kubevela" {
      + atomic                     = false
      + chart                      = "vela-core"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "vela-core"
      + namespace                  = "vela-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubevela.github.io/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + verify                     = false
      + version                    = "1.9.13"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.linode_lke_kubevela.helm_release.traefik will be created
  + resource "helm_release" "traefik" {
      + atomic                     = false
      + chart                      = "traefik"
      + cleanup_on_fail            = false
      + create_namespace           = true
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "traefik"
      + namespace                  = "traefik"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://traefik.github.io/charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "certificatesResolvers":
                  "letsEncrypt":
                    "acme":
                      "caServer": "https://acme-v02.api.letsencrypt.org/directory"
                      "email": "emmanuel@uplanit.xyz"
                      "httpChallenge":
                        "entryPoint": "web"
                      "storage": "/data/acme.json"
                      "tlschallenge": {}
                "deployment":
                  "initContainers":
                  - "command":
                    - "sh"
                    - "-c"
                    - "chmod -Rv 777 /data/* && touch /data/acme.json && chmod -Rv 600 /data/* &&
                      chown 65532:65532 /data/acme.json"
                    "image": "busybox:1.31.1"
                    "name": "volume-permissions"
                    "securityContext":
                      "runAsGroup": 0
                      "runAsNonRoot": false
                      "runAsUser": 0
                    "volumeMounts":
                    - "mountPath": "/data"
                      "name": "traefik"
                "ingressRoute":
                  "dashboard":
                    "enabled": true
                "persistence":
                  "enabled": true
                  "name": "traefik"
                  "path": "/data"
                  "size": "128Mi"
                "ports":
                  "web":
                    "http":
                      "redirections":
                        "entryPoint":
                          "permanent": true
                          "scheme": "https"
                          "to": "websecure"
                  "websecure":
                    "tls":
                      "certResolver": "letsEncrypt"
                      "enabled": true
                "providers":
                  "kubernetesCRD":
                    "enabled": true
            EOT,
        ]
      + verify                     = false
      + version                    = "33.0.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.linode_lke_kubevela.linode_lke_cluster.k8s_cluster will be created
  + resource "linode_lke_cluster" "k8s_cluster" {
      + api_endpoints = (known after apply)
      + dashboard_url = (known after apply)
      + id            = (known after apply)
      + k8s_version   = "1.31"
      + kubeconfig    = (sensitive value)
      + label         = "uplanit-cluster"
      + region        = "eu-central"
      + status        = (known after apply)
      + tags          = [
          + "testing",
        ]

      + control_plane (known after apply)

      + pool {
          + count           = 2
          + disk_encryption = (known after apply)
          + id              = (known after apply)
          + nodes           = (known after apply)
          + type            = "g6-standard-1"
        }
    }

  # module.linode_lke_kubevela.null_resource.add-ghrc-secrets-kubectl will be created
  + resource "null_resource" "add-ghrc-secrets-kubectl" {
      + id = (known after apply)
    }

  # module.linode_lke_kubevela.null_resource.add_kubevela_experimental_addon_registry will be created
  + resource "null_resource" "add_kubevela_experimental_addon_registry" {
      + id = (known after apply)
    }

  # module.linode_lke_kubevela.null_resource.apply_ingress_route_trait will be created
  + resource "null_resource" "apply_ingress_route_trait" {
      + id = (known after apply)
    }

  # module.linode_lke_kubevela.null_resource.create_temp_kubeconfig will be created
  + resource "null_resource" "create_temp_kubeconfig" {
      + id = (known after apply)
    }

  # module.linode_lke_kubevela.null_resource.enable_mongodb_operator will be created
  + resource "null_resource" "enable_mongodb_operator" {
      + id = (known after apply)
    }

  # module.linode_lke_kubevela.null_resource.initialise_kubevela_environments will be created
  + resource "null_resource" "initialise_kubevela_environments" {
      + id = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @noelenwenede, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*